{
  "posts": [
    {
      "id": 2,
      "title": "update",
      "content": "test",
      "comments": [
        "hello2",
        "great post2",
        "test comment2",
        "trst",
        "test adding comment",
        "ghjk",
        "test adding new comments",
        "test commens"
      ]
    },
    {
      "id": 3,
      "title": "Javascript (yura post)",
      "content": "JavaScript — це найпопулярніша мова програмування для вебу. Він керує динамікою сайтів, а також використовується у backend-розробці",
      "comments": []
    },
    {
      "id": 4,
      "title": "Настільний теніс🏓",
      "content": "Настільний теніс — це динамічна і захоплива гра, яка розвиває швидкість реакції, координацію та стратегічне мислення. Гравці використовують легкі ракетки для перекидання м'яча через сітку на столі, намагаючись зробити так, щоб суперник не зміг його відбити. Спорт популярний у всьому світі, а змагання з настільного тенісу входять до програми Олімпійських ігор. Гра підходить як для розваги, так і для серйозних професійних тренувань.",
      "comments": []
    },
    {
      "id": 5,
      "title": "The SL lineup will likely continue to offer a range of powertrains, including:",
      "content": "SL 43: A 2.0-liter turbocharged inline-4 with mild hybrid technology.\n\nSL 55: A 3.0-liter inline-6 turbocharged engine with hybrid assistance.\n\nSL 63: A high-performance 4.0-liter V8 biturbo engine with hybrid tech.\n\nSL 73e: A plug-in hybrid variant with a V8 engine and electric motor, delivering over 800 horsepower.",
      "comments": []
    },
    {
      "id": 6,
      "title": "Як Інтернет змінив наш світ",
      "content": "Відкриття інтернету змінило світ назавжди. Початок цієї революції можна вважати 1983 рік, коли було впроваджено протокол TCP/IP, що дозволив комп'ютерам з'єднуватися між собою. Однак перші великі кроки до сьогоднішнього глобального мережевого середовища сталися з появою World Wide Web в 1991 році, створеного Тімом Бернерс-Лі. Інтернет спочатку використовувався для академічних і військових цілей, але з часом перетворився на доступну платформу для всіх, відкриваючи нові можливості для комунікації, бізнесу та навчання, змінюючи спосіб нашого життя і взаємодії з інформацією.",
      "comments": []
    }
  ]
}